BsAtHome/atpack/Atmel.ATtiny_DFP.atpack/edc/ATtiny402.PIC
        <edc:AdjustPoint edc:_addr="0x51" edc:offset="0xF"/>
        <edc:SFRDef edc:_addr="0x60" edc:access="n-----nn" edc:cname="MCLKCTRLA" edc:impl="0x83" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="CLKCTRL">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CLKCTRL">
              <edc:SFRFieldDef edc:cname="CLKSEL" edc:desc="clock select" edc:nzwidth="0x2">
                <edc:SFRFieldSemantic edc:cname="OSC20M" edc:desc="20MHz internal oscillator" edc:when="(field &amp; 0x3) == 0x00"/>
                <edc:SFRFieldSemantic edc:cname="OSCULP32K" edc:desc="32KHz internal Ultra Low Power oscillator" edc:when="(field &amp; 0x3) == 0x01"/>
                <edc:SFRFieldSemantic edc:cname="XOSC32K" edc:desc="32.768kHz external crystal oscillator" edc:when="(field &amp; 0x3) == 0x02"/>
                <edc:SFRFieldSemantic edc:cname="EXTCLK" edc:desc="External clock" edc:when="(field &amp; 0x3) == 0x03"/>
              </edc:SFRFieldDef>
              <edc:AdjustPoint edc:offset="0x5"/>
              <edc:SFRFieldDef edc:cname="CLKOUT" edc:desc="System clock out" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x61" edc:access="---nnnnn" edc:cname="MCLKCTRLB" edc:impl="0x1F" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="CLKCTRL">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CLKCTRL">
              <edc:SFRFieldDef edc:cname="PEN" edc:desc="Prescaler enable" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PDIV" edc:desc="Prescaler division" edc:nzwidth="0x4">
                <edc:SFRFieldSemantic edc:cname="2X" edc:desc="2X" edc:when="(field &amp; 0xF) == 0x00"/>
                <edc:SFRFieldSemantic edc:cname="4X" edc:desc="4X" edc:when="(field &amp; 0xF) == 0x01"/>
                <edc:SFRFieldSemantic edc:cname="8X" edc:desc="8X" edc:when="(field &amp; 0xF) == 0x02"/>
                <edc:SFRFieldSemantic edc:cname="16X" edc:desc="16X" edc:when="(field &amp; 0xF) == 0x03"/>
                <edc:SFRFieldSemantic edc:cname="32X" edc:desc="32X" edc:when="(field &amp; 0xF) == 0x04"/>
                <edc:SFRFieldSemantic edc:cname="64X" edc:desc="64X" edc:when="(field &amp; 0xF) == 0x05"/>
                <edc:SFRFieldSemantic edc:cname="6X" edc:desc="6X" edc:when="(field &amp; 0xF) == 0x08"/>
                <edc:SFRFieldSemantic edc:cname="10X" edc:desc="10X" edc:when="(field &amp; 0xF) == 0x09"/>
                <edc:SFRFieldSemantic edc:cname="12X" edc:desc="12X" edc:when="(field &amp; 0xF) == 0x0A"/>
                <edc:SFRFieldSemantic edc:cname="24X" edc:desc="24X" edc:when="(field &amp; 0xF) == 0x0B"/>
                <edc:SFRFieldSemantic edc:cname="48X" edc:desc="48X" edc:when="(field &amp; 0xF) == 0x0C"/>
              </edc:SFRFieldDef>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x62" edc:access="-------n" edc:cname="MCLKLOCK" edc:impl="0x1" edc:nzwidth="0x8" ltx:memberofperipheral="CLKCTRL">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CLKCTRL">
              <edc:SFRFieldDef edc:cname="LOCKEN" edc:desc="lock ebable" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x63" edc:access="rrrr---r" edc:cname="MCLKSTATUS" edc:impl="0xF1" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="CLKCTRL">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CLKCTRL">
              <edc:SFRFieldDef edc:cname="SOSC" edc:desc="System Oscillator changing" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x3"/>
              <edc:SFRFieldDef edc:cname="OSC20MS" edc:desc="20MHz oscillator status" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OSC32KS" edc:desc="32KHz oscillator status" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="XOSC32KS" edc:desc="32.768 kHz Crystal Oscillator status" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EXTS" edc:desc="External Clock status" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:_addr="0x64" edc:offset="0xC"/>
        <edc:SFRDef edc:_addr="0x70" edc:access="------n-" edc:cname="OSC20MCTRLA" edc:impl="0x2" edc:nzwidth="0x8" ltx:memberofperipheral="CLKCTRL">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CLKCTRL">
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="RUNSTDBY" edc:desc="Run standby" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x71" edc:access="--nnnnnn" edc:cname="OSC20MCALIBA" edc:impl="0x3F" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="CLKCTRL">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CLKCTRL">
              <edc:SFRFieldDef edc:cname="CAL20M" edc:desc="Calibration" edc:nzwidth="0x6"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x72" edc:access="n---nnnn" edc:cname="OSC20MCALIBB" edc:impl="0x8F" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="CLKCTRL">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CLKCTRL">
              <edc:SFRFieldDef edc:cname="TEMPCAL20M" edc:desc="Oscillator temperature coefficient" edc:nzwidth="0x4"/>
              <edc:AdjustPoint edc:offset="0x3"/>
              <edc:SFRFieldDef edc:cname="LOCK" edc:desc="Lock" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:_addr="0x73" edc:offset="0x5"/>
        <edc:SFRDef edc:_addr="0x78" edc:access="------n-" edc:cname="OSC32KCTRLA" edc:impl="0x2" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="CLKCTRL">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CLKCTRL">
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="RUNSTDBY" edc:desc="Run standby" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:_addr="0x79" edc:offset="0x7"/>
        <edc:SFRDef edc:_addr="0x80" edc:access="---nnnnn" edc:cname="CTRLA" edc:impl="0x1F" edc:mclr="00000101" edc:nzwidth="0x8" edc:por="00000101" ltx:memberofperipheral="BOD">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="BOD">
              <edc:SFRFieldDef edc:cname="SLEEP" edc:desc="Operation in sleep mode" edc:nzwidth="0x2">
                <edc:SFRFieldSemantic edc:cname="DIS" edc:desc="Disabled" edc:when="(field &amp; 0x3) == 0x00"/>
                <edc:SFRFieldSemantic edc:cname="ENABLED" edc:desc="Enabled" edc:when="(field &amp; 0x3) == 0x01"/>
                <edc:SFRFieldSemantic edc:cname="SAMPLED" edc:desc="Sampled" edc:when="(field &amp; 0x3) == 0x02"/>
              </edc:SFRFieldDef>
              <edc:SFRFieldDef edc:cname="ACTIVE" edc:desc="Operation in active mode" edc:nzwidth="0x2">
                <edc:SFRFieldSemantic edc:cname="DIS" edc:desc="Disabled" edc:when="(field &amp; 0x3) == 0x00"/>
                <edc:SFRFieldSemantic edc:cname="ENABLED" edc:desc="Enabled" edc:when="(field &amp; 0x3) == 0x01"/>
                <edc:SFRFieldSemantic edc:cname="SAMPLED" edc:desc="Sampled" edc:when="(field &amp; 0x3) == 0x02"/>
                <edc:SFRFieldSemantic edc:cname="ENWAKE" edc:desc="Enabled with wakeup halt" edc:when="(field &amp; 0x3) == 0x03"/>
              </edc:SFRFieldDef>
              <edc:SFRFieldDef edc:cname="SAMPFREQ" edc:desc="Sample frequency" edc:nzwidth="0x1">
                <edc:SFRFieldSemantic edc:cname="1KHZ" edc:desc="1kHz sampling" edc:when="(field &amp; 0x1) == 0x0"/>
                <edc:SFRFieldSemantic edc:cname="125Hz" edc:desc="125Hz sampling" edc:when="(field &amp; 0x1) == 0x1"/>
              </edc:SFRFieldDef>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
