BsAtHome/atpack/Atmel.ATtiny_DFP.atpack/edc/ATtiny402.PIC
        <edc:SFRDef edc:_addr="0x202" edc:access="----nnnn" edc:cname="CTRLC" edc:impl="0xF" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="PORTMUX">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PORTMUX">
              <edc:SFRFieldDef edc:cname="TCA00" edc:desc="Port Multiplexer TCA0 Output 0" edc:nzwidth="0x1">
                <edc:SFRFieldSemantic edc:cname="DEFAULT" edc:desc="Default pin" edc:when="(field &amp; 0x1) == 0"/>
                <edc:SFRFieldSemantic edc:cname="ALTERNATE" edc:desc="Alternate pin" edc:when="(field &amp; 0x1) == 1"/>
              </edc:SFRFieldDef>
              <edc:SFRFieldDef edc:cname="TCA01" edc:desc="Port Multiplexer TCA0 Output 1" edc:nzwidth="0x1">
                <edc:SFRFieldSemantic edc:cname="DEFAULT" edc:desc="Default pin" edc:when="(field &amp; 0x1) == 0"/>
                <edc:SFRFieldSemantic edc:cname="ALTERNATE" edc:desc="Alternate pin" edc:when="(field &amp; 0x1) == 1"/>
              </edc:SFRFieldDef>
              <edc:SFRFieldDef edc:cname="TCA02" edc:desc="Port Multiplexer TCA0 Output 2" edc:nzwidth="0x1">
                <edc:SFRFieldSemantic edc:cname="DEFAULT" edc:desc="Default pin" edc:when="(field &amp; 0x1) == 0"/>
                <edc:SFRFieldSemantic edc:cname="ALTERNATE" edc:desc="Alternate pin" edc:when="(field &amp; 0x1) == 1"/>
              </edc:SFRFieldDef>
              <edc:SFRFieldDef edc:cname="TCA03" edc:desc="Port Multiplexer TCA0 Output 3" edc:nzwidth="0x1">
                <edc:SFRFieldSemantic edc:cname="DEFAULT" edc:desc="Default pin" edc:when="(field &amp; 0x1) == 0"/>
                <edc:SFRFieldSemantic edc:cname="ALTERNATE" edc:desc="Alternate pin" edc:when="(field &amp; 0x1) == 1"/>
              </edc:SFRFieldDef>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x203" edc:access="-------n" edc:cname="CTRLD" edc:impl="0x1" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="PORTMUX">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PORTMUX">
              <edc:SFRFieldDef edc:cname="TCB0" edc:desc="Port Multiplexer TCB" edc:nzwidth="0x1">
                <edc:SFRFieldSemantic edc:cname="DEFAULT" edc:desc="Default pin" edc:when="(field &amp; 0x1) == 0x0"/>
                <edc:SFRFieldSemantic edc:cname="ALTERNATE" edc:desc="Alternate pin" edc:when="(field &amp; 0x1) == 0x1"/>
              </edc:SFRFieldDef>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:_addr="0x204" edc:offset="0x1FC"/>
        <edc:SFRDef edc:_addr="0x400" edc:access="nnnnnnnn" edc:cname="DIR" edc:nzwidth="0x8" ltx:memberofperipheral="PORTA"/>
        <edc:SFRDef edc:_addr="0x401" edc:access="nnnnnnnn" edc:cname="DIRSET" edc:nzwidth="0x8" ltx:memberofperipheral="PORTA"/>
        <edc:SFRDef edc:_addr="0x402" edc:access="nnnnnnnn" edc:cname="DIRCLR" edc:nzwidth="0x8" ltx:memberofperipheral="PORTA"/>
        <edc:SFRDef edc:_addr="0x403" edc:access="nnnnnnnn" edc:cname="DIRTGL" edc:nzwidth="0x8" ltx:memberofperipheral="PORTA"/>
        <edc:SFRDef edc:_addr="0x404" edc:access="nnnnnnnn" edc:cname="OUT" edc:nzwidth="0x8" ltx:memberofperipheral="PORTA"/>
        <edc:SFRDef edc:_addr="0x405" edc:access="nnnnnnnn" edc:cname="OUTSET" edc:nzwidth="0x8" ltx:memberofperipheral="PORTA"/>
        <edc:SFRDef edc:_addr="0x406" edc:access="nnnnnnnn" edc:cname="OUTCLR" edc:nzwidth="0x8" ltx:memberofperipheral="PORTA"/>
        <edc:SFRDef edc:_addr="0x407" edc:access="nnnnnnnn" edc:cname="OUTTGL" edc:nzwidth="0x8" ltx:memberofperipheral="PORTA"/>
        <edc:SFRDef edc:_addr="0x408" edc:access="nnnnnnnn" edc:cname="IN" edc:nzwidth="0x8" ltx:memberofperipheral="PORTA"/>
        <edc:SFRDef edc:_addr="0x409" edc:access="nnnnnnnn" edc:cname="INTFLAGS" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="PORTA">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PORTA">
              <edc:SFRFieldDef edc:cname="INT" edc:desc="Pin Interrupt" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:_addr="0x40A" edc:offset="0x6"/>
        <edc:SFRDef edc:_addr="0x410" edc:access="n---nnnn" edc:cname="PIN0CTRL" edc:impl="0x8F" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="PORTA">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PORTA">
              <edc:SFRFieldDef edc:cname="ISC" edc:desc="Input/Sense Configuration" edc:nzwidth="0x3">
                <edc:SFRFieldSemantic edc:cname="INTDISABLE" edc:desc="Interrupt disabled but input buffer enabled" edc:when="(field &amp; 0x7) == 0x00"/>
                <edc:SFRFieldSemantic edc:cname="BOTHEDGES" edc:desc="Sense Both Edges" edc:when="(field &amp; 0x7) == 0x01"/>
                <edc:SFRFieldSemantic edc:cname="RISING" edc:desc="Sense Rising Edge" edc:when="(field &amp; 0x7) == 0x02"/>
                <edc:SFRFieldSemantic edc:cname="FALLING" edc:desc="Sense Falling Edge" edc:when="(field &amp; 0x7) == 0x03"/>
                <edc:SFRFieldSemantic edc:cname="INPUT_DISABLE" edc:desc="Digital Input Buffer disabled" edc:when="(field &amp; 0x7) == 0x04"/>
                <edc:SFRFieldSemantic edc:cname="LEVEL" edc:desc="Sense low Level" edc:when="(field &amp; 0x7) == 0x05"/>
              </edc:SFRFieldDef>
              <edc:SFRFieldDef edc:cname="PULLUPEN" edc:desc="Pullup enable" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x3"/>
              <edc:SFRFieldDef edc:cname="INVEN" edc:desc="Inverted I/O Enable" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x411" edc:access="n---nnnn" edc:cname="PIN1CTRL" edc:impl="0x8F" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="PORTA">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PORTA">
              <edc:SFRFieldDef edc:cname="ISC" edc:desc="Input/Sense Configuration" edc:nzwidth="0x3">
                <edc:SFRFieldSemantic edc:cname="INTDISABLE" edc:desc="Interrupt disabled but input buffer enabled" edc:when="(field &amp; 0x7) == 0x00"/>
                <edc:SFRFieldSemantic edc:cname="BOTHEDGES" edc:desc="Sense Both Edges" edc:when="(field &amp; 0x7) == 0x01"/>
                <edc:SFRFieldSemantic edc:cname="RISING" edc:desc="Sense Rising Edge" edc:when="(field &amp; 0x7) == 0x02"/>
                <edc:SFRFieldSemantic edc:cname="FALLING" edc:desc="Sense Falling Edge" edc:when="(field &amp; 0x7) == 0x03"/>
                <edc:SFRFieldSemantic edc:cname="INPUT_DISABLE" edc:desc="Digital Input Buffer disabled" edc:when="(field &amp; 0x7) == 0x04"/>
                <edc:SFRFieldSemantic edc:cname="LEVEL" edc:desc="Sense low Level" edc:when="(field &amp; 0x7) == 0x05"/>
              </edc:SFRFieldDef>
              <edc:SFRFieldDef edc:cname="PULLUPEN" edc:desc="Pullup enable" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x3"/>
              <edc:SFRFieldDef edc:cname="INVEN" edc:desc="Inverted I/O Enable" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x412" edc:access="n---nnnn" edc:cname="PIN2CTRL" edc:impl="0x8F" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="PORTA">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PORTA">
              <edc:SFRFieldDef edc:cname="ISC" edc:desc="Input/Sense Configuration" edc:nzwidth="0x3">
                <edc:SFRFieldSemantic edc:cname="INTDISABLE" edc:desc="Interrupt disabled but input buffer enabled" edc:when="(field &amp; 0x7) == 0x00"/>
                <edc:SFRFieldSemantic edc:cname="BOTHEDGES" edc:desc="Sense Both Edges" edc:when="(field &amp; 0x7) == 0x01"/>
                <edc:SFRFieldSemantic edc:cname="RISING" edc:desc="Sense Rising Edge" edc:when="(field &amp; 0x7) == 0x02"/>
                <edc:SFRFieldSemantic edc:cname="FALLING" edc:desc="Sense Falling Edge" edc:when="(field &amp; 0x7) == 0x03"/>
                <edc:SFRFieldSemantic edc:cname="INPUT_DISABLE" edc:desc="Digital Input Buffer disabled" edc:when="(field &amp; 0x7) == 0x04"/>
                <edc:SFRFieldSemantic edc:cname="LEVEL" edc:desc="Sense low Level" edc:when="(field &amp; 0x7) == 0x05"/>
              </edc:SFRFieldDef>
              <edc:SFRFieldDef edc:cname="PULLUPEN" edc:desc="Pullup enable" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x3"/>
              <edc:SFRFieldDef edc:cname="INVEN" edc:desc="Inverted I/O Enable" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
